/* -------------------------------------------------------------
앞으로 졸업할때까지 유용하고 재사용성이 높은 코드는 모아두자!
나만의 라이브러리
---------------------------------------------------------------*/


/* -----------------------------------------------------
1. 매개변수 n : 0~n미만까지의 랜덤한 수를 반환하는 함수
------------------------------------------------------*/
function getRandom(n){
    var r=parseInt(Math.random()*n); //0.00xxx ~ 1미만 사이의 난수를 발생시켜줌 
    // console.log(r);
    return r;
}

/* -----------------------------------------------------
2. 색상을 랜덤으로 가져오는 함수
------------------------------------------------------*/
function rgbRandom(){
    var r=parseInt(Math.random()*256);
    var g=parseInt(Math.random()*256);
    var b=parseInt(Math.random()*256);
    return rgb(r+","+g+","+b);
}


/* -----------------------------------------------------
3. 오브젝트 삭제(1.화면에서 삭제 2.메모리상 삭제)
        container : 어떤 부모 요소에서 지울지 결정
        child : 어떤 요소를 지울지
        arr : 어떤 배여레 있는지
        index : 해단 배열의 몇번째 요소를 지울지
------------------------------------------------------*/
function removeObject(container, child, arr, index){
    container.removeChild(child);
    arr.splice(index,1);
}

