/* -------------------------------------------------------------
앞으로 졸업할때까지 유용하고 재사용성이 높은 코드는 모아두자!
나만의 라이브러리
---------------------------------------------------------------*/



/* -----------------------------------------------------
매개변수 n : 0~n미만까지의 랜덤한 수를 반환하는 함수
------------------------------------------------------*/
function getRandom(n){
    var r=parseInt(Math.random()*n); //0.00xxx ~ 1미만 사이의 난수를 발생시켜줌 
    // console.log(r);
    return r;
}


/* -----------------------------------------------------
오브젝트 삭제(1.화면에서 삭제 2.메모리상 삭제)
------------------------------------------------------*/
//이 함수를 호출하는 자는 어디로부터 지울지 container를 넘겨줘야함
function removeObject(container, child, arr, index){
    //화면에서 삭제(부모 div로부터 제거)
    //부모div.removeChild(지울대상 즉 자식요소);
    container.removeChild(child);
    //배열에서 삭제
    //배열.splice(몇번째 인덱스,1);
    arr.splice(index,1);
}

/* -----------------------------------------------------
색상을 랜덤으로 가져오는 함수
------------------------------------------------------*/
function rgbRandom(){
    var r=parseInt(Math.random()*256);
    var g=parseInt(Math.random()*256);
    var b=parseInt(Math.random()*256);
    return rgb(r+","+g+","+b);
}